# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary

In [1]:
# import libraries here
import pandas as pd
import numpy as np

# Challenge 1

#### Open the ` Employee.csv` file and name your dataset `employee`

In [2]:
# your answer here
df_emp = pd.read_csv('Employee.csv')

In [3]:
df_emp

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### What's the mean salary by department. 
##### Tip : There are 2 ways to do it - one way is with and the other way is without pivot tables. Do it both ways.

In [4]:
# your answer here-1st way

df_dep = df_emp.groupby('Department')['Salary'].mean()
df_dep

Department
HR       45.00
IT       48.75
Sales    55.00
Name: Salary, dtype: float64

In [5]:
# your answer here-2nd way

df_dep2 = pd.pivot_table(df_emp, values = 'Salary', columns = 'Department', aggfunc='mean')
df_dep2

Department    HR     IT  Sales
Salary      45.0  48.75   55.0

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title

In [6]:
# your answer here
df_dep3 = pd.pivot_table(df_emp, values = 'Salary', index = 'Title', columns = ['Department'], aggfunc='mean')

df_dep3

Department    HR    IT  Sales
Title
VP          70.0  70.0    NaN
analyst     32.5  32.5    NaN
associate    NaN  60.0   55.0

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [7]:
# your answer here
new_pivot = pd.pivot_table(df_emp, values = ['Salary'], index = ['Title', 'Years'], columns = 'Department', aggfunc='mean')
new_pivot

                Salary
Department          HR    IT Sales
Title     Years
VP        8       70.0  70.0   NaN
analyst   1        NaN  35.0   NaN
          2       30.0  30.0   NaN
          4       35.0   NaN   NaN
associate 2        NaN   NaN  55.0
          3        NaN   NaN  55.0
          7        NaN  60.0   NaN

#### We want to know the information about the mean salary and number of employees in each department and for each job title

In [8]:
# your answer here
new_pivot2 = pd.pivot_table(df_emp, values = ['Salary'], index = ['Title'], columns = 'Department', aggfunc={'Salary' : 'mean', 'Title' :'count'})
new_pivot2

           Salary             Title
Department     HR    IT Sales    HR   IT Sales
Title
VP           70.0  70.0   NaN   1.0  1.0   NaN
analyst      32.5  32.5   NaN   2.0  2.0   NaN
associate     NaN  60.0  55.0   NaN  1.0   2.0

#### We want to know for each department and for each job title the Salary's median,minimum,maximum and standard deviation. Comment your results

In [22]:
new_pivot3 = pd.pivot_table(df_emp, values = ['Salary'], index = ['Title'], columns = 'Department', aggfunc=['median', 'min', 'max', 'std']).copy()
new_pivot3

           median                min                max                   std  \
           Salary             Salary             Salary                Salary
Department     HR    IT Sales     HR    IT Sales     HR    IT Sales        HR
VP           70.0  70.0   NaN   70.0  70.0   NaN   70.0  70.0   NaN       NaN
analyst      32.5  32.5   NaN   30.0  30.0   NaN   35.0  35.0   NaN  3.535534
associate     NaN  60.0  55.0    NaN  60.0  55.0    NaN  60.0  55.0       NaN



Department        IT Sales
VP               NaN   NaN
analyst     3.535534   NaN
associate        NaN   0.0

#### Based on your comments, fill the missing values with an appropriate value

In [32]:
# your answer here
x = new_pivot3['median']['Salary']['HR'][0]
new_pivot4.at['VP', ('min', 'Salary', 'Sales')] = x

In [33]:
new_pivot4

           median                min                max                   std  \
           Salary             Salary             Salary                Salary
Department     HR    IT Sales     HR    IT Sales     HR    IT Sales        HR
VP           70.0  70.0  70.0   70.0  70.0  70.0   70.0  70.0   NaN       NaN
analyst      32.5  32.5   NaN   30.0  30.0   NaN   35.0  35.0   NaN  3.535534
associate     NaN  60.0  55.0    NaN  60.0  55.0    NaN  60.0  55.0       NaN



Department        IT Sales
VP               NaN   NaN
analyst     3.535534   NaN
associate        NaN   0.0

In [25]:
new_pivot3.columns

MultiIndex([('median', 'Salary',    'HR'),
            ('median', 'Salary',    'IT'),
            ('median', 'Salary', 'Sales'),
            (   'min', 'Salary',    'HR'),
            (   'min', 'Salary',    'IT'),
            (   'min', 'Salary', 'Sales'),
            (   'max', 'Salary',    'HR'),
            (   'max', 'Salary',    'IT'),
            (   'max', 'Salary', 'Sales'),
            (   'std', 'Salary',    'HR'),
            (   'std', 'Salary',    'IT'),
            (   'std', 'Salary', 'Sales')],
           names=[None, None, 'Department'])

In [ ]:
new_pivot3.loc()

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [50]:
# your answer here
new_pivot6 = pd.pivot_table(df_emp, values = ['Salary', 'Title'], columns = 'Department', aggfunc={'Title': 'count',
                                                                                                  'Salary' : 'sum'})
new_pivot6

Department   HR   IT  Sales
Salary      135  195    110
Title         3    4      2

#### For each Department and Title, we want to know the the total years of work experience and the mean salary

In [11]:
# your answer here

#### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table

#### * Hint: Write a custom function*

In [12]:
# your answer here--Your custom function here

In [13]:
# your answer here

# Challenge 2

#### Open the ` Fitbit.csv` file and name your dataset `fitbit`

In [14]:
# your answer here

#### Explore you dataset in terms of data types and descriptive statistics
#### *Hint: Use Pandas functions from previous lectures*

In [15]:
# your answer here

In [16]:
# your answer here

#### You suspect that there must be a linear relationship between the Minutes Very Active and the Steps. Compute the correlation between these variables.

In [17]:
# your answer here

#### Use matplotlib to visually plot Minutes Very active vs Steps. 

##### Hint : import matplotlib.pyplot as plt (See previous lessons)#####
- Use plt.scatter(x=df['col_name_1'], y=df['col_name_2'])

In [18]:
# your answer here

#### What can you say about Minute Very Active and Steps? Write a comment below

In [19]:
# your comment here

#### We also suspect that there must be a linear relationship between the Minutes Sedentary and the Steps. Compute the correlation between these variables.

In [20]:
# your answer here

#### Use matplotlib to visually plot Minutes Sedentary vs Steps. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [21]:
# your answer here

In [22]:
# Your comment here

#### We also suspect that there must be a linear relationship between the MinutesOfSleep and the Steps. Compute the correlation between these variables.

In [23]:
# your answer here

#### Use matplotlib to visually plot MinutesOfSleep vs Steps. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [24]:
# your answer here

#### Select a subset of your dataset with the columns below and compute the correlation matrix. Save the results in the variable `cor_fit`
column= ['Calorie burned', 'Steps','Floors','Minutes Sedentary','Minutes Very Active', 'MinutesOfSleep']

In [25]:
# your answer here

In [26]:
#Print cor_fit

#### Based on the result of the correlation matrix. What are the highly correlated features with the variable Steps?
*Hint: From the results above select the variable Steps and order your results in descending order (use Pandas sort_values function)*

In [27]:
# your answer here

# Challenge 3

#### Open the `Time_Grades.csv` file and name your dataset `time_grades`

In [52]:
# your answer here
time_grades = pd.read_csv('Time_Grades.csv')

        Name  Study time  Grade
0       Jose           4      4
1      Maria           9      7
2      David           8      9
3      Sonia          10      7
4     Samuel          20      9
5        Eva           5      3
6     Carlos          12      7
7      Pedro           6      5
8        Ana          18      9
9   Gervasio           7      3
10     Gemma           7      8
11    Alicia          11      7
12  Jonathan           2      1
13  Cristina          13      8
14     Pilar           3      2

In [53]:
#Print time_grades
print (time_grades)

        Name  Study time  Grade
0       Jose           4      4
1      Maria           9      7
2      David           8      9
3      Sonia          10      7
4     Samuel          20      9
5        Eva           5      3
6     Carlos          12      7
7      Pedro           6      5
8        Ana          18      9
9   Gervasio           7      3
10     Gemma           7      8
11    Alicia          11      7
12  Jonathan           2      1
13  Cristina          13      8
14     Pilar           3      2

#### Show visually the frequency distribution of the time_grades dataset.

In [30]:
# your answer here

#### Is there a correaltion between study time and Grade? Use both Pearson and Spearman correlation and comment your results.

In [31]:
# your answer here-Pearson

In [32]:
## your answer here-Spearman

#### Use matplotlib to visually plot Study time vs Grade. Based on the results of the computed correlation and the plot. What can you say about these 2 variables?

In [33]:
# your answer here

In [34]:
#your comment here

#### Could you explain the difference between Pearson and Spearman correlation? (see References in README.md)

In [35]:
#your comment here